Machine Learning Astronomy Related Project

In [2]:
import kagglehub 

path = kagglehub.dataset_download("datascientist97/astronomical-data")
print(f'path to dataset files {path}')

/workspaces/my_ML_learning_projects/.venv1/lib/python3.12/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

path to dataset files /home/codespace/.cache/kagglehub/datasets/datascientist97/astronomical-data/versions/1

In [3]:
import pandas as pd
import os 

print(os.listdir(path))   #this command is to retrieve the exact file name cotaining the data

['cleaned_star_data.csv']

In [4]:
file_path = os.path.join(path, 'cleaned_star_data.csv')      #creating the file path so i can use pandas to open it
df = pd.read_csv(file_path)
df.head(10)

,Temperature (K),Luminosity(L/Lo),Radius(R/Ro),Absolute magnitude(Mv),Star type,Star color,Spectral Class
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,3042,0.0005,0.1542,16.6,0.0,Red,M
2,2600,0.0003,0.102,18.7,0.0,Red,M
3,2800,0.0002,,16.65,0.0,Red,M
4,1939,0.000138,0.103,20.06,0.0,Red,M
5,2840,,0.11,16.98,0.0,Red,M
6,2637,0.00073,0.127,17.22,0.0,Red,M
7,2600,0.0004,0.096,17.4,0.0,Red,M
8,2650,0.00069,0.11,17.45,0.0,Red,M
9,2700,0.00018,0.13,16.05,0.0,Red,M

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240 entries, 0 to 239
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Temperature (K)         239 non-null    object
 1   Luminosity(L/Lo)        239 non-null    object
 2   Radius(R/Ro)            239 non-null    object
 3   Absolute magnitude(Mv)  239 non-null    object
 4   Star type               239 non-null    float64
 5   Star color              239 non-null    object
 6   Spectral Class          239 non-null    object
dtypes: float64(1), object(6)
memory usage: 13.3+ KB

In [6]:
df.describe()

       Star type
count  239.00000
mean     2.51046
std      1.70728
min      0.00000
25%      1.00000
50%      3.00000
75%      4.00000
max      5.00000

The Data I found in Kaggle doesn't seem to be cleaned or organized, there are even some missing ones, so I will try to clean it so I can use it without having trouble with biases.

In [7]:
#first, I will check for duplicated rows

index_list=df[df.duplicated(keep=False)].index.tolist()
if not index_list : 
    print('list is empty, there are no duplicated rows')
else :
    print(j for j in index_list)

list is empty, there are no duplicated rows

It appears that there are no duplicated rows !

In [8]:

#df.duplicated(keep=False) return a series of True (for duplicated rows) and/or False (for unique rows).
# the df[df.duplicated(keep=False)] keeps the case where df.duplicated(keep=False) is true, hence duplicated.

df[df.duplicated(keep=False)]

Empty DataFrame
Columns: [Temperature (K), Luminosity(L/Lo), Radius(R/Ro), Absolute magnitude(Mv), Star type, Star color, Spectral Class]
Index: []

In [9]:
#Checking for missing values
df.isnull().sum()

Temperature (K)           1
Luminosity(L/Lo)          1
Radius(R/Ro)              1
Absolute magnitude(Mv)    1
Star type                 1
Star color                1
Spectral Class            1
dtype: int64

It appears that each column has exactly one missing value

In [10]:
new_df = df.drop(index=0) #deleting row with index = 0 because it contains missing values
new_df

,Temperature (K),Luminosity(L/Lo),Radius(R/Ro),Absolute magnitude(Mv),Star type,Star color,Spectral Class
1,3042,0.0005,0.1542,16.6,0.0,Red,M
2,2600,0.0003,0.102,18.7,0.0,Red,M
3,2800,0.0002,,16.65,0.0,Red,M
4,1939,0.000138,0.103,20.06,0.0,Red,M
5,2840,,0.11,16.98,0.0,Red,M
...,...,...,...,...,...,...,...
235,38940,374830,1356,-9.93,5.0,Blue,O
236,30839,834042,1194,-10.63,5.0,Blue,O
237,8829,537493,1423,-10.73,5.0,White,A
238,9235,404940,1112,-11.23,5.0,White,A
239,37882,294903,1783,-7.8,5.0,Blue,O

In [11]:
#Since I am used to index 0 being first and not 1, I am going to use .reset_index

new_df.reset_index()

,index,Temperature (K),Luminosity(L/Lo),Radius(R/Ro),Absolute magnitude(Mv),Star type,Star color,Spectral Class
0,1,3042,0.0005,0.1542,16.6,0.0,Red,M
1,2,2600,0.0003,0.102,18.7,0.0,Red,M
2,3,2800,0.0002,,16.65,0.0,Red,M
3,4,1939,0.000138,0.103,20.06,0.0,Red,M
4,5,2840,,0.11,16.98,0.0,Red,M
...,...,...,...,...,...,...,...,...
234,235,38940,374830,1356,-9.93,5.0,Blue,O
235,236,30839,834042,1194,-10.63,5.0,Blue,O
236,237,8829,537493,1423,-10.73,5.0,White,A
237,238,9235,404940,1112,-11.23,5.0,White,A
238,239,37882,294903,1783,-7.8,5.0,Blue,O

In [12]:
new_df.isnull().sum()

Temperature (K)           0
Luminosity(L/Lo)          0
Radius(R/Ro)              0
Absolute magnitude(Mv)    0
Star type                 0
Star color                0
Spectral Class            0
dtype: int64

I no longer have NaN values, but I still notice some empty columns, so I will work on that now.

In [13]:
print((df==" ").sum())   #I specified the space " " to retrieve empty columns

Temperature (K)           2
Luminosity(L/Lo)          6
Radius(R/Ro)              7
Absolute magnitude(Mv)    5
Star type                 0
Star color                6
Spectral Class            2
dtype: int64

Now, I will replace the empty spaces with NaN to facilitate the process of replacing them. For more information please visit this page https://sparkbyexamples.com/pandas/pandas-replace-blank-values-with-nan/#:~:text=Pandas%20Replace%20Blank%20Values%20with,case%20of%20the%20specified%20value.

In [20]:
newest_df = new_df.mask(new_df == " ")

#now checking if missing values are detected
newest_df.isnull().sum()

Temperature (K)           2
Luminosity(L/Lo)          6
Radius(R/Ro)              7
Absolute magnitude(Mv)    5
Star type                 0
Star color                6
Spectral Class            2
dtype: int64